In [1]:
import pandas as pd 
import numpy as np

In [4]:
df = pd.read_csv('../Mall_Customers.csv')

In [5]:
X = df.loc[ : ,'Genre' :  ]

In [6]:
#각 컬럼별로 문자인지 파악

In [8]:
X

      Genre  Age  Annual Income (k$)  Spending Score (1-100)
0      Male   19                  15                      39
1      Male   21                  15                      81
2    Female   20                  16                       6
3    Female   23                  16                      77
4    Female   31                  17                      40
..      ...  ...                 ...                     ...
195  Female   35                 120                      79
196  Female   45                 126                      28
197    Male   32                 126                      74
198    Male   32                 137                      18
199    Male   30                 137                      83

[200 rows x 4 columns]

In [11]:
X.columns[0]

'Age'

In [15]:
df[X.columns[0]]

0        Male
1        Male
2      Female
3      Female
4      Female
        ...
195    Female
196    Female
197      Male
198      Male
199      Male
Name: Genre, Length: 200, dtype: object

In [16]:
df[X.columns[0]].dtype

dtype('O')

In [17]:
df[X.columns[0]].dtype == object

True

In [29]:
from sklearn.preprocessing import LabelEncoder , OneHotEncoder
from sklearn.compose import ColumnTransformer

In [36]:
X_new = pd.DataFrame()

In [40]:
X_new

     Genre
0        1
1        1
2        0
3        0
4        0
..     ...
195      0
196      0
197      1
198      1
199      1

[200 rows x 1 columns]

In [53]:
X_new = pd.DataFrame()

for name in X.columns : 
    
    # 각 컬럼을 가져온다
    data = X[name]
    
    # 문자열인지 아닌지 나눠서 처리
    if data.dtype == object :
        
        # 문자열이니 갯수가 2개인지 아닌지 파악해서 2개면 레이블인코딩, 그렇지 않으면 원핫인코딩
        
        # 레이블 인코딩
        if data.nunique() <= 2 :
            label_encoder = LabelEncoder()
            X_new[name] = label_encoder.fit_transform(data)
        
        # 원핫 인코딩
        else :
            ct = ColumnTransformer( [('encoder', OneHotEncoder(), [0])], remainder= 'passthrough' )
            col_names = sorted( data.unique() )
            X_new[ col_names ] = ct.fit_transform( data.to_frame() )
            
    else :
        # 숫자 데이터 처리
        X_new[name] = data

In [44]:
ct = ColumnTransformer(  [('encoder',OneHotEncoder,[0])], remainder='passthrough')

In [45]:
X['Genre'].unique()

array(['Male', 'Female'], dtype=object)

In [ ]:
ct.fit_transform( X['Genre'].to_frame())

In [54]:
X_new

     Genre  Age  Annual Income (k$)  Spending Score (1-100)
0        1   19                  15                      39
1        1   21                  15                      81
2        0   20                  16                       6
3        0   23                  16                      77
4        0   31                  17                      40
..     ...  ...                 ...                     ...
195      0   35                 120                      79
196      0   45                 126                      28
197      1   32                 126                      74
198      1   32                 137                      18
199      1   30                 137                      83

[200 rows x 4 columns]